Question 1. The value displayed when the last expression a is evaluated is '6'. 
when first expression b() is initialized the value of a becomes 2
a=c(a)

c(a) returns a+2

0+2 = 2

when second expression b() is initialized the value of a becomes 4
current value of a is 2

c(a) returns a+2

2+2=4

when third expression b() is initialized the value of a becomes 6
current value of a is 4

c(a) returns a+2

4+2=6

when we call a the value returned is 6.

although if we want the value to show on screen we need to call it as 

print(a)

In [4]:
#Question 2
import os.path
def file_length(file_name):
    if os.path.isfile(file_name):
        file = open(file_name)
        contents = file.read()
        file.close()
        print(len(contents))
    else:
        print("File does not exist")

file_length('main.py')

File does not exist

In [2]:
#Question 4
def collatz(x):
    if x <= 1:
        return True
    else:
        if x % 2 == 0:
            x = x / 2
            print(x)
            collatz(x)
        elif x % 2 != 0:
            x = (3 * x) + 1
            print(x)
            collatz(x)


v = int(input("enter the value"))
collatz(v)

enter the value5
16
8.0
4.0
2.0
1.0

In [1]:
#Question 5
def binary(x):
    if x == 0:
        return [0]
    bit = []
    while x:
        bit.append(x % 2)
        x >>= 1
    return bit[::-1]


x = int(input("enter an integer"))
print(binary(x))

enter an integer99
[1, 1, 0, 0, 0, 1, 1]

Question 8

In [2]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [3]:
%%sql
CREATE TABLE TEMPDATA(City Varchar(50), Country Varchar(50), Season Varchar(50), Temparature decimal(10),Rainfall decimal(10));

 * sqlite://
Done.

[]

In [7]:
%%sql
INSERT INTO TEMPDATA VALUES('Mumbai','India','Winter','24.8','5.9');
INSERT INTO TEMPDATA VALUES('Mumbai','India','Spring','28.4','16.2');
INSERT INTO TEMPDATA VALUES('Mumbai','India','Summer','27.9','1549.4');
INSERT INTO TEMPDATA VALUES('Mumbai','India','Fall','27.6','346.0');
INSERT INTO TEMPDATA VALUES('London','United Kingdom','Winter','4.2','207.7');
INSERT INTO TEMPDATA VALUES('London','United Kingdom','Spring','8.3','169.6');
INSERT INTO TEMPDATA VALUES('London','United Kingdom','Summer','15.7','157.0');
INSERT INTO TEMPDATA VALUES('London','United Kingdom','Fall','10.4','218.5');
INSERT INTO TEMPDATA VALUES('Cairo','Egypt','Winter','13.6','16.5');
INSERT INTO TEMPDATA VALUES('Cairo','Egypt','Spring','20.7','6.5');
INSERT INTO TEMPDATA VALUES('Cairo','Egypt','Summer','27.7','0.1');
INSERT INTO TEMPDATA VALUES('Cairo','Egypt','Fall','22.2','4.5');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql
SELECT Temparature FROM TEMPDATA

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [10]:
%%sql
SELECT CITY FROM TEMPDATA
GROUP BY CITY

 * sqlite://
Done.

[('Cairo',), ('London',), ('Mumbai',)]

In [11]:
%%sql
SELECT * FROM TEMPDATA WHERE Country='India'

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346)]

In [12]:
%%sql
SELECT * FROM TEMPDATA WHERE Season='Fall'

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [16]:
%%sql
SELECT City , Country ,Season FROM TEMPDATA WHERE Rainfall BETWEEN 200 AND 400

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

In [21]:
%%sql
SELECT City,Country FROM TEMPDATA WHERE Season='fall' AND Temparature>'20.0' ORDER BY Temparature

 * sqlite://
Done.

[]

In [22]:
%%sql
SELECT SUM(Rainfall) FROM TEMPDATA WHERE Country='Cairo'

 * sqlite://
Done.

[(None,)]

In [ ]:
Question 9

In [25]:
words=['The','quick','brown','fox','jumps','over','the','lazy','dog']
for x in words:
    print(x.upper())

THE
QUICK
BROWN
FOX
JUMPS
OVER
THE
LAZY
DOG

In [26]:
for x in words:
    print(x.lower())

the
quick
brown
fox
jumps
over
the
lazy
dog

In [27]:
for x in words:
    print(len(x))

3
5
5
3
5
4
3
4
3

In [28]:
for x in words:
    print(x.upper())
    print(x.lower())
    print(len(x))

THE
the
3
QUICK
quick
5
BROWN
brown
5
FOX
fox
3
JUMPS
jumps
5
OVER
over
4
THE
the
3
LAZY
lazy
4
DOG
dog
3

In [29]:
for x in words:
    if len(x)>=4:
        print(x)

quick
brown
jumps
over
lazy